app/controllers/posts_controller.rb

  def create
    @post = Post.new(params[:post])
    if @post.save
---
INSERT INTO "posts" ("artist", "price", "created_at", "title", "updated_at", "date", "description") VALUES('Renoire', 0.0, '2011-09-29 16:17:33', 'Afternoon on the Grand Jete', '2011-09-29 16:17:33', '2011-09-29 16:16:00', 'This classic painting is an excellent example of pointillism, a delicate art...')